---
title: "Pandas-Missing-Data"
author: "Palaniappan S"
date: 2020-09-04
description: "-"
type: technical_note
draft: false
---

In [2]:
import numpy as np
import scipy.stats
import pandas as pd
import sklearn

In [3]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

df

        one       two     three
a -1.594997 -0.870257 -0.040415
b       NaN       NaN       NaN
c  0.242981 -0.829525  0.167767
d       NaN       NaN       NaN
e -0.243680  0.341354  0.342675
f -0.443074 -0.915286  0.799884
g       NaN       NaN       NaN
h -0.692233  1.093079 -0.116146

In [4]:
#Check for Missing Values
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [5]:
#Calculations with Missing Data
df['one'].sum()

-2.7310031100055356

In [6]:
df['one'].sum()

-2.7310031100055356

In [7]:
#Cleaning / Filling Missing Data
#Replace NaN with a Scalar Value
df.fillna(0)

        one       two     three
a -1.594997 -0.870257 -0.040415
b  0.000000  0.000000  0.000000
c  0.242981 -0.829525  0.167767
d  0.000000  0.000000  0.000000
e -0.243680  0.341354  0.342675
f -0.443074 -0.915286  0.799884
g  0.000000  0.000000  0.000000
h -0.692233  1.093079 -0.116146

In [8]:
#Fill NA Forward and Backward
df.fillna(method='pad')

        one       two     three
a -1.594997 -0.870257 -0.040415
b -1.594997 -0.870257 -0.040415
c  0.242981 -0.829525  0.167767
d  0.242981 -0.829525  0.167767
e -0.243680  0.341354  0.342675
f -0.443074 -0.915286  0.799884
g -0.443074 -0.915286  0.799884
h -0.692233  1.093079 -0.116146

In [9]:
#Drop Missing Values
df.dropna()

        one       two     three
a -1.594997 -0.870257 -0.040415
c  0.242981 -0.829525  0.167767
e -0.243680  0.341354  0.342675
f -0.443074 -0.915286  0.799884
h -0.692233  1.093079 -0.116146

In [10]:
#Replace Missing (or) Generic Values

df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})

df.replace({1000:10,2000:60})

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60